{"/docs/getting-started":{"title":"Getting started","data":{"create-a-blueprint-attribute-set#Create a Blueprint Attribute Set":"First thing first, we need to create the Blueprint for our Attribute Set. To do so, right click in the Content Browser and click on:Gameplay > Gameplay Blueprint Attributes > Gameplay Blueprint Attribute SetThe prefix used here for Blueprint Attribute Sets will be \"GBA_\", standing for Gameplay Blueprint Attributes.We're going to implement a simple AttributeSet to hold a Health variable: GBA_Health_Set\nIt is highly recommended to always use the Context Menu asset action to create new Blueprint Attribute Sets.\nDoing so will ensure the Blueprint is using a specific UBlueprint (UGBAAttributeSetBlueprint) and a customized BlueprintEditor (FGBABlueprintEditor). We will go over briefly each of its features.","blueprint-attributes-editor#Blueprint Attributes Editor":"Upon first opening, the Blueprint Editor will look like this.\nA few additional buttons can be found in the toolbar, next to the PIE and Debugging controls.We will go over each of these buttons shortly.","creating-a-new-attribute#Creating a new Attribute":"","add-attribute-button#Add Attribute Button":"But first let's click on the \"Add Attribute\" button.This combo button brings up a new panel with a form and a few inputs to help with the creation of new Gameplay Attribute properties.\nThe type can be either FGameplayAttributeData or FGBAGameplayClampedAttributeData (FGameplayAttributeData with built-in clamping features)\nThe Replication checkbox can be used if the Attribute needs to be replicated, and will generate the appropriate Rep_Notify function and implementation.\nIt's a quicker and less error-prone way of creating a new Gameplay Attribute variable, by enforcing proper types and saving a few clicks / manual steps.You should now have a newly created Gameplay Attribute variable, with type FGameplayAttributeData.Along with an \"OnRep_Health\" function (the rep notify) if you checked the Replication checkbox.","attribute-details#Attribute Details":"With the Health variable selected, the Detail panel should look like this.The important part that is customized by the plugin is the Default Value panel, where you can see the Base and Current value of the Attribute, and change its default value directly from within the Blueprint Editor (courtesy of one of our Details customization class, FGBAGameplayAttributeDataDetails).","rep-notify#Rep Notify":"if you checked the Replication checbox, a rep notify function should be implemented for you, with the required call to HandleRepNotifyForGameplayAttribute().The main role of HandleRepNotifyForGameplayAttribute() is to handle attributes that will be predictively modified by clients, something that is usually done with GAMEPLAYATTRIBUTE_REPNOTIFY helper macro in C++.","class-defaults#Class Defaults":"Now that we have at least one variable created, we can take a look at the Details panel for the Class Defaults (by clicking on this button in the toolbar)It is adding a new \"Add Attribute\" button (same function as the one in the toolbar) and listing each and every BP variables. The Gameplay Attribute Data properties are then displayed like here, providing you a simple way to see and tweak all your Attributes at once and their default values.Here is an example with an Attribute Set and more Gameplay Attributes.","details-settings#Details Settings":"You can customize that part of the Editor with few Details Customization option in the Project Settings.Open up the Project Settings, then scroll down to the bottom of the sidebar. You should see a \"Blueprint Attributes\" section where all the configurable settings for the Plugin can be found.\nUse Compact ViewIf you turn on Compact View mode in the Project Settings, Details for Gameplay Attributes Data properties will be simplified and use a simplified display.For both class defaults variables and when viewing / editing a single Attribute Data property, making the edition of BaseValue possible in the header of the row.Only for simple Gameplay Attribute Data properties, clamped properties still display using the full extended version (like the Endurance Attribute above, we'll go over Gameplay Clamped Attribute properties in their own section)Header Format TextThe other relevant setting is \"Header Format Text\".Customize how the header row is displayed and what should be included. This is a FText::Format format string, with two floats being passed in as an argument (BaseValue and CurrentValue). Both float values are converted to String with \"%.2f\" to reduce precision to only two decimals (Default Value: \"Base: {0}, Current: {1}\")You could even get fancy and use utf8 emojis in there 😉","attribute-sets#Attribute Sets":"","registering-the-attribute-set-with-the-asc#Registering the Attribute Set with the ASC":"Once you create an Attribute Set with one or more Gameplay Attributes, we need to register (or grant) it to the appropriate Ability System Component.\nYou can refer to Register Attribute Sets with the ASC for more options.\nHere, we'll use the InitStats() engine method, as part of the ASC API, to grant the Attribute Set on Begin Play.If we know test in-game and use the gameplay debugger, we can see the Attributes properly registered with our ASC and ready to use.","gameplay-debugger#Gameplay Debugger":"Hit Play and launch the game in PIE, and open up the console command by pressing the backtick key ` (normally located below the ESC key) on QWERTY keyboards or the ² on AZERTY keyboards.\nYou can customize this in Project Settings > Engine > Input > Console > Console Keys.\nThen type showdebug abilitysystem in the console to display the Gameplay Debugger for Gameplay Abilities. You should in the first \"Attributes\" page the Attribute(s) we defined earlier.You can also use the new AbilitySystem.DebugAttribute command.Type AbilitySystem.DebugAttribute Health to add a little overlay for a simple display of desired attributes (you can pass a list of Attributes to display with a space separated list of Attribute names).\nYou can pass a list of Attributes to the command with a space separated list of Attribute names.\nEnter the command again to hide the overlay if it is visible (toggle behavior).","initialization#Initialization":"In this section, we'll talk about the various ways we have to initialize the Attribute values (the Base Value).","initializing-attributes#Initializing Attributes":"This is a good time to talk about a Blueprint Attributes plugin specific feature. If you select the Gameplay Attribute property in the Blueprint Editor, or click on the \"Class Defaults\" button in the toolbar, you'll be able to change the default Attribute value directly from within the Details Panel.Set it to an arbitrary value, for example 100.\nThis is normally not an exposed value, and not editable in the Details panel, but an Editor Details customization of Blueprint Attributes plugin is taking care of exposing that to Blueprints.\nThis is the equivalent in C++ of setting a Gameplay Attribute default value via its constructor in an AttributeSet header:\nUPROPERTY(BlueprintReadOnly, Category = \"Attributes\", ReplicatedUsing = OnRep_Health)\nFGameplayAttributeData Health = 0.0f;\nIf we now launch the game in PIE and use the Gameplay Debugger commands, we should see the Attribute with its new default value:","data-tables#Data Tables":"Another popular way to initialize attributes beyond their default value, and further specialize Gameplay Attributes value based on the Actor (and ASC) it belongs, is through the use of Data Table.Both the InitStats() method of the ASC and its Default Starting Data property (more infos and options in Register Attribute Sets with the ASC) accepts an additional Data Table and a Gameplay Ability System row type called AttributeMetaData.Example using InitStats() on Begin Play or Possessed Events","creating-the-data-table#Creating the Data Table":"","manually#Manually":"Hint: The next section explains how to do this automatically 😉\nYou can create AttributeMetaData Data Tables the usual way, by right-clicking in the Content Browser, and clicking on Miscellaneous > Data Table (or importing from an external .csv file).In the \"Pick Row Structure\" dialog that appears, choose AttributeMetaData for the row type.You have the option to add extra rows to support Attribute Sets with multiple Gameplay Attributes. In the file shown below, the \"Health\" Gameplay Attribute within GBA_Health_Set Blueprint will initialize with a value of 1000.The syntax for the row name is AttributeClassName.AttributeName (without the \"U\" prefix for C++ defined Attribute Set, and without the \"_C\" suffix for Blueprint defined Attribute Set).","automatically-with-create-datatable-toolbar-button#Automatically with Create DataTable Toolbar Button":"The Blueprint Attributes Editor Toolbar provides an additional \"Create DataTable\" button to quickly create an initialization AttributeMetaData Data Table, based on the defined Gameplay Attributes in the Blueprint Editor.It'll generate additional rows for each defined Attributes, with their Base Value set accordingly.If you click on the \"Create DataTable\" button, you'll get the following window:\nIf you click on \"Save\" next, a new DataTable asset with the appropriate row type and content generated based on your defined attributes will be created.\nThe path for the DataTable is by default next to the Attribute Set Blueprint it originates from, but you can tweak this with the left panel and Tree View.\nThe name for the DataTable is by default DT_{AttributeBlueprintName} (for instance for a Blueprint GBA_Health_Set, the default name for the DataTable will be DT_GBA_Health_Set). You can change the name of the DataTable asset in the Name input field.\nHere is an example for a Blueprint AttributeSet with slightly more Gameplay Attributes, and their BaseValue slightly modified:\nAnd here is the resulting DataTable:","built-in-clamping#Built-in Clamping":"Clamping of Attribute, to ensure that their values are always within the limits that you set for them, is a common pattern. That's why Blueprint Attributes plugin come with some pre-defined and built-in clamping behavior that you can opt-in.You can perform Attributes clamping with one of three methods, two of which are the built-in clamping features coming with the plugin.\nwith DataTable - To initialize the Attributes, and using the MinValue and MaxValue columns. The Attribute Set Blueprint Base class is able to handle those Min/Max column values, and execute a built-in clamping behavior.\nwith Gameplay Clamped Attribute Data properties - A customizable clamping using a special Gameplay Clamped Attribute Data property (a child of FGameplayAttributeData) with float or Attribute-based clamping.\nManual Clamping - You'd implement the clamping behavior yourself, with your own rules with the BP exposed method / events of Attribute Sets (PreAttributeChange(), PreAttributeBaseChange() or PostGameplayEffectExecute())\nUGBAAttributeSetBlueprintBase::PostGameplayEffectExecute() is the method responsible of clamping, and the order for those is the following:\nManual Clamping (if done in PostGameplayEffectExecute BP Event)\nClamping via Clamped Properties (if the Attribute is implemented as a FGBAGameplayClampedAttributeData).\nClamping via DataTables Min and Max value columns (if the Set was initialized with a DataTable, and if MinValue < MaxValue).\nTest Setup To better illustrate the clamping behavior in-game, we'll use Gameplay Effects with Infinite duration to setup a regen and degen mechanic for the Health Attribute.\nYou could also use Gameplay Abilities activated on Input, to apply an Instant Gameplay Effect to either damage or heal the Character (by adding or removing a set of amount of Hit Points from the Health Attribute).\nThis demonstration setup can be found in the Content Examples project in the 02_Builtin_Clamping map.\nFor these instructions, I'm using an AttributeSet made just for this clamping demonstration, with a single Health Attribute variable.GBA_Clamping_Example_HealthSet\nAnd two Gameplay Effects, one to continuously add to the Health Attribute, one to continuously substract from the Health Attribute.GE_Clamping_HealthRegen\nGE_Clamping_HealthDegen\nBoth are Infinite Gameplay Effects, with a Period duration of 0.1, and either adds or remove 10 from the Health Attribute every 100ms.GE_Clamping_HealthRegen is configured to only be active if the Owner Character doesn't have GameplayEffect.Clamping.Degen Gameplay Tag, which is added by GE_Clamping_HealthDegen whenever it's applied.Next, we need to ensure the Regen Gameplay Effect is applied. Since it's an Infinite Effect, it'll be active indefinitely (or until explicitly removed).You can simply apply the effect programmatically on Begin Play (or Possesed) event, or using the list of Gameplay Effects to apply your GAS bakend could provide to you (GAS Companion's ASC Granted Effects, or Lyra's Ability Sets and Granted Gameplay Effects)Without any clamping applied, the Health Attribute value will go up indefinitely.And similarly go down if we apply the Degen effect (which is done in the Content Examples project by stepping onto the Button Pad Blueprint).","with-datatable#With DataTable":"This is the simplest and quickest way to get clamping done for Gameplay Attributes.This implies you're using a DataTable to initiliaze your Attribute values (eg. Data Tables section).\nIf we build upon our previous Attribute Set example, with a single Health Attribute, we can tweak the DataTable used for initialization and set the Min and Max value columns to arbitrary values. In the following example, we'll init the value to 0, but configure the clamping to ensure the value will between 10 to 100.If we launch the game in PIE, we can see the value for the Health Attribute initialized to 10 (started at 0, then clamping took place and set it to 10)To test lower and higher bound limits we configured for the clamping, we can use the Regen / Degen effect described in the Test Setup section.","with-gameplay-clamped-attribute-data-properties#With Gameplay Clamped Attribute Data properties":"Add a new Attribute for your set, but this time using a FGBAGameplayClampedAttributeData. You can quickly do so by clicking on the \"Add Attribute\" button in the Blueprint Editor Toolbar, and choosing the appropriate type.\nOnce again, you can find the implementation described here as part of the Content Examples project in the 02_Builtin_Clamping map.\nThis time, we are going to implement an Endurance Attribute (a classic!) that will act as a resource cost for a given set of actions. In this simplistic example, it's going to be on a Jump ability (another classic!).If you then compile the Blueprint and select the newly added variable, you'll see in the Details panel a slightly different display.FGBAGameplayClampedAttributeData is a child struct of FGameplayAttributeData, it contains the usual Base Value, along with two new FGBAClampDefinition properties: a MinValue and a MaxValue.The Clamp definition for both of these provides a Clamp Type behavior:\nFloat Based (default): Uses a simple, static float for the clamping.\nAttribute Based: Performs a clamping based upon another attribute.\nNone: Clamping is disabled for this definition.\nWe need another Attribute to demonstrate the Attribute Based clamping type for our Endurance attribute called MaxEndurance. Let's quickly create the new attribute.You can then give it an arbitrary value (and / or use an initialization DataTable to set its value):We can then go back to the clamped definitions of Endurance, by selecting the variable or using the Class Defaults view, and adjust the clamping definition for MaxValue to be based on the MaxEndurance attribute.\nTake note that only the Attributes belonging to the same Attribute Set are intentionally selectable. This deliberate design choice serves to prevent interdependence between different Attribute Set classes and to maintain the principle of encapsulation.","manual-clamping#Manual Clamping":"","interactions-with-gameplay-effects#Interactions with Gameplay Effects":"","preattributechange--preattributebasechange#PreAttributeChange / PreAttributeBaseChange":"","postattributechange--postattributebasechange#PostAttributeChange / PostAttributeBaseChange":"","pregameplayeffectexecute#PreGameplayEffectExecute":"","postgameplayeffectexecute#PostGameplayEffectExecute":"{\n  \"PreAttributeChange\": \"PreAttributeChange / PreAttributeBaseChange\",\n  \"PostAttributeChange\": \"PostAttributeChange / PostAttributeBaseChange\",\n  \"PreGameplayEffectExecute\": \"PreGameplayEffectExecute\",\n  \"PostGameplayEffectExecute\": \"PostGameplayEffectExecute\"\n}","helper-methods#Helper Methods":"","getattributevalue#GetAttributeValue()":"","setattributevalue#SetAttributeValue()":"","clampattributevalue#ClampAttributeValue()":"","replication#Replication":"","gameplay-effects#Gameplay Effects":""}},"/docs/nextra":{"title":"Nextra","data":{"some-nextra-testing#Some nextra testing":"","callout-examples#Callout Examples":"This guide is not done yet, and this is an example of <Callout /> component rendered in mdx documents.\nThis guide is not done yet, and this is an example of <Callout type=\"default /> component rendered in mdx documents.\nThis guide is not done yet, and this is an example of <Callout type=\"info\" /> component rendered in mdx documents.\nThis guide is not done yet, and this is an example of <Callout type=\"warning\" /> component rendered in mdx documents.\nThis guide is not done yet, and this is an example of <Callout type=\"error\" /> component rendered in mdx documents.","images#Images":"","syntax-highlighing#Syntax Highlighing":"/** @type {import('tailwindcss').Config} */\nmodule.exports = {\n  content: [\n    './pages/**/*.{js,jsx,ts,tsx,md,mdx}',\n    './components/**/*.{js,jsx,ts,tsx,md,mdx}',\n \n    // Or if using `src` directory:\n    './src/**/*.{js,jsx,ts,tsx,md,mdx}'\n  ],\n  theme: {\n    extend: {}\n  },\n  plugins: []\n}\n[/Script/BlueprintAttributesEditor.GBAEditorSettings]\nbUseCompactView=False\nHeaderFormatText=NSLOCTEXT(\"[/Script/BlueprintAttributesEditor]\", \"66324208429F69E6BC5C6281BEF3C7CF\", \"🙌 Attribute Value: {0} 🚀😂\")\nclass FGBAModule : public IModuleInterface\n{\npublic:\n\t/** IModuleInterface implementation */\n\tvirtual void StartupModule() override;\n\tvirtual void ShutdownModule() override;\n};"}},"/docs/project-setup":{"title":"Project Setup","data":{"":"The few steps explained here are the minimum requirements to get started with this plugin.","enabling-the-plugin#Enabling the plugin":"Make sure to enable the plugin in the Plugins Window.Doing so will also enable \"Gameplay Abilities\" plugin as well (plugin dependency).Once done, you can restart the project.","adding-the-asc-ability-system-component#Adding the ASC (Ability System Component)":"Add the actor component \"Ability System\" to your Character Blueprint, rename it to AbilitySystemComponent for good measure.In the components panel, click the \"Add\" button and search for \"AbilitySystem\".\nRename the component to \"AbilitySystemComponent\" (optional, but it'll keep it consistent as if it was added in C++)\nAdding the ASC to your Actors is usually done in C++ (and before engine 5.0, it was mandatory). For example in Lyra or using GAS Companion, you'd have this component created for you already. For the purpose of these instructions, we simply add the component in Blueprint and you can freely skip this step if this is applicable to you.","register-attribute-sets-with-the-asc#Register Attribute Sets with the ASC":"In the next sections, we are going to create Attribute Sets (in Blueprint!).\nThe prefix used here for Blueprint Attribute Sets will be \"GBA_\", standing for Gameplay Blueprint Attributes. But you are free to choose the prefix for your project and name them as you please.\nYou will eventually have to register the Attribute Sets with the appropriate ASC for these Attributes to appear and have an impact in-game. You can do so with either:\nOnBeginPlay and using the InitStats() method on the ASC (this is engine API)\nYou can also add the Attribute Set type to the ASC's Default Starting Data (in the details panel with ASC selected, again engine API). Keep in mind that for it to work, you need to provide both the Attribute Set type and a DefaultStartingTable DataTable (even if the latter is empty). This is the current engine implementation skipping initialization if the DataTable is not provided.\nDetails panel with Ability System Component selected in the Blueprint Editor\nA third method depends on your usual GAS backend. Be it Lyra / GAS Companion or you own implementation, they each have their own way of providing a list of Attributes to grant (conceptually similar to DefaultStartingData in 2.)\nWith GAS Companion, you can for instance use the Granted Attributes array on the ASC or an Ability Set. In Lyra, you'll likely register Attribute Sets via a PawnData and an AbilitySet DataAsset.\nOr even,  if you use Game Features, via a GameFeature action (in GAS Companion or Lyra) and the Attributes list they both provide."}},"/docs/resources/content-examples-project":{"title":"Content Examples Project","data":{}},"/":{"title":"Index","data":{}},"/docs":{"title":"Introduction","data":{"":"The \"Gameplay Blueprint Attributes\" plugin, also known as \"Blueprint Attributes\" or GBA for short, is a valuable extension to the Gameplay Ability System (GAS) plugin. It addresses a fundamental limitation of the Unreal Engine, making UAttributeSet fully blueprintable. This enhancement allows for a seamless workflow entirely within the Unreal Engine Editor and Blueprints, simplifying the process of working with Attribute Sets and Gameplay Attributes.","the-problem#The Problem":"Without the Blueprint Attributes plugin, Unreal Engine requires that Attributes and Attribute Sets must be created exclusively in native code, rendering Blueprint creation impossible. This limitation can be restrictive for Game Designers and Blueprint Developers, hindering their ability to iterate swiftly on Attribute design.","our-solution#Our Solution":"With this plugin, we seek to enhance the overall experience of creating and managing Attributes and Attribute Sets.Blueprint Attributes is designed as a powerful solution to the inherent limitations of Unreal Engine, specifically when it comes to the creation and management of Attributes and Attribute Sets. We recognize that Unreal Engine's default behavior mandates the creation of these vital components exclusively in native code, preventing Game Designers and Blueprint Developers from fully harnessing the potential of Blueprints during game development with GAS.Empowering Blueprint Development: Blueprint Attributes steps in to empower Blueprint Developers and Game Designers by providing a robust and user-friendly framework for managing Attributes. This means that you no longer need to rely solely on C++ coding to define and manipulate Attributes and Attribute Sets. With Blueprint Attributes, you can seamlessly integrate Attributes into your Blueprint-based workflows, eliminating the need for complex and time-consuming native code implementations.Fostering Rapid Iteration: One of the core objectives of Blueprint Attributes is to foster rapid iteration and experimentation during the game development process. By allowing you to work directly within the Unreal Engine Editor and Blueprints, Blueprint Attributes streamlines your workflow and minimizes the obstacles that traditionally slow down the iteration cycle. You can now make real-time changes to Attributes and Attribute Sets, test them, and iterate as needed without the impediments of native code development.Enhancing Collaboration: Blueprint Attributes not only empowers individual developers but also enhances collaboration within development teams. Game Designers can work closely with Blueprint Developers to fine-tune Attributes, leveraging the intuitive visual scripting capabilities of Blueprints. This fosters better communication and a more iterative and collaborative approach to game design.Preserving Compatibility: While Blueprint Attributes introduces a Blueprint-centric approach to Attribute management, it also maintains compatibility with the existing Gameplay Abilities ecosystem and workflow. This ensures that your project remains aligned with Unreal Engine's best practices while benefiting from the advantages of Blueprint-based Attribute creation.The plugin serves as a bridge between the intuitive visual scripting capabilities of Blueprints and the robust performance of native code. This allows for a seamless transition from prototyping in Blueprints to the optimized efficiency of C++. The Attribute Wizard, a key feature of Blueprint Attributes, streamlines this transition process, providing a clear path to convert Blueprint-defined Attributes into efficient C++ classes.In summary, Blueprint Attributes is your solution to breaking free from the constraints of native code when working with Attributes and Attribute Sets in Unreal Engine. By offering a user-friendly and versatile approach to Attribute management, it empowers developers, accelerates iteration cycles, encourages collaboration, and seamlessly integrates with existing workflows. With Blueprint Attributes, you're not just overcoming a limitation; you're unlocking the full potential of Unreal Engine's Blueprint system for your game development journey.","plugin-features#Plugin Features":"Blueprint Attributes comes equipped with an extensive set of features to enrich the developer experience and maintain compatibility with the existing Gameplay Abilities ecosystem and workflow. These features include:\nRuntime Module: A runtime module provides a base UAttributeSet class for inheritance.\nCustom UBlueprint and FBlueprintEditor: Custom classes that facilitate Blueprint-based Attribute management.\nEditor Modules: Additional modules for streamlined editor integration.\nDetails Customizations: A wide array of classes and Slate widgets to fine-tune attribute details within the Unreal Editor.\nAttribute Wizard: A powerful tool designed to assist in transitioning from Attributes defined in Blueprints to C++ classes. It generates the appropriate C++ class based on the AttributeSet defined in Blueprints and the Attributes it contains. This allows developers to either inherit from the generated class or migrate entirely to native implementations.\nBy providing these features, Blueprint Attributes aims to simplify the workflow and maximize flexibility when working with Attributes in Unreal Engine.","key-features-of-blueprint-attributes-plugin#Key Features of Blueprint Attributes Plugin":"Key Features of Blueprint Attributes Plugin\nQuicker Iterations\nEmpower Game Designers and Blueprint Developers to rapidly iterate on Attribute design.\nDefine Attributes in Blueprint\nCreate Attribute property variables in the Blueprint Editor for immediate use in Gameplay Effects, K2 Nodes (e.g., GetFloatAttribute()), and other locations where a Gameplay Attribute picker is applicable.\nBuilt-in Clamping\nSupport for clamping via Data Table initialization.\nHandling of \"Min Value\" and \"Max Value\" columns.\nCustomizable clamping using a special Gameplay Clamped Attribute Data property (a child of FGameplayAttributeData) with float or Attribute-based clamping.\nCustomized Blueprint Editor\nBlueprint Editor with Data Validation.\nToolbar with quick-access buttons for:\nAdding Gameplay Attribute properties.\nCreation of Data Tables.\nPorting BP Attribute Sets to standard C++ Attribute Sets.\nDetails Customizations to expose Attribute BaseValue to Blueprint and set it directly from the Details panel.\nInteractions with Gameplay Effects\nAttribute Sets can override several functions to control how an Attribute responds when a Gameplay Effect attempts to modify it.\nMost of this API is exposed to Blueprints (e.g., PostGameplayEffectExecute, Pre/PostAttributeChange).\nReplication\nReplication support for Gameplay Attributes defined in Blueprints, suitable for multiplayer projects.\nHandling of LifetimeReplicatedProps.\nIntegration of rep notifies to manage predictively modified attributes by clients (equivalent to the C++ GAMEPLAYATTRIBUTE_REPNOTIFY macro).\nIntegration with K2 Nodes\nK2 Nodes (Blueprint nodes) that use FGameplayAttribute parameters now display a list of Attributes defined in Blueprints in the combo box, similar to Gameplay Attribute properties in Gameplay Effects.\nAttribute Wizard for Blueprint to C++ Transition\nA wizard and Scaffold module facilitate the transition from Blueprint-defined Attributes to C++.\nGenerates proper C++ header and source files (with preview!) based on defined Gameplay Attributes in the BP Attribute Set.\nReferencer Handlers\nDetects Attribute renaming in the Blueprint Editor.\nOffers to replace previous references to the renamed Attribute in Gameplay Effects.\nDisplays a list of modified properties and Blueprint nodes (K2Nodes) in the message log with clickable links for easy navigation to the referencers.\nThese features collectively enhance your workflow, simplify Attribute management, and provide powerful tools for Blueprint-based development within Unreal Engine."}}}